

public class SeventhLoop {
    public static void main(String[] args) {
        int i = 2;
        while (i <= 10) {
            System.out.println( "Even number: " + i);
            i += 2;
        }
    }
}



//Напишите программу SeventhLoop.java, которая выводит все 
// четные числа от 1 до 11. Решение этого задания должно быть 
// реализовано с использованием цикла while. Подсказка: Два 
// способа реализации этого задания: Проверить, является ли 
// значение счетчика четным числом, и если да, вывести значение 
// на экран. Чётные числа — это числа, которые при делении на 2 
// не оставляют остатка — можно использовать оператор деления по 
// модулю (%). В предыдущих упражнениях вы добавляли единицу к
//  значению счётчика на каждой итерации. Вы можете инициализировать
//  значение счётчика равным 2 и увеличивать его на 2 на каждой
//  итерации. Пример выходных данных выглядит следующим образом.