package Assessment1;

public class Exercise {
    public static void main(String[] args) {
        int age = 47;
        String name = "Jim";
        String job = "Carpenter";
        double wages = 878.23;
        System.out.println(name + " works as a " + job + ". He is " + age +
         " yers old. He earns " + wages + " after tax." );
    }
}



//Рассмотрите следующее утверждение: «Джим работает плотником. 
// Ему 47 лет. Он зарабатывает 878,23 после вычета налогов.»
//  Это утверждение содержит несколько значений. 
// Определите важные значения из приведенного выше утверждения 
// и присвойте эти значения переменным подходящего типа.
//  После того как переменные объявлены и им присвоены значения,
//  восстановите вышеуказанное утверждение, используя переменные.
//  Выведите восстановленное утверждение на экран следующим образом: 
// Джим работает плотником. Ему 47 лет. Он зарабатывает 878,23 после
//  вычета налогов. Примечание: На 3 строки, а не в одной строке. 
// Весь код для этого упражнения должен быть размещен в файле с именем Exercise1.java.